export const differences = {
    lab1: 'Реализовать скрипт, который уведомит о полной загрузке страницы. Реализовать кнопку счетчик, которая будет увеличивать счетчик на "1" и вывести его значение на страницу (button onclick)',
    lab2: 'Создать "Hello World" приложение на основе React. Для создания можно использовать create-react-app или vite. Реализовать компонент кнопку, контейнер и использовать их на странице',
    lab3: 'Продолжаем задание Реализовать шаблон страницы и разместить на нем компоненты навигации Реализуем компоненты Header, Footer, Menu и Content. В меню выводим список лабораторных работ, в Content  выводим содержимое лабораторной работы, разместить проект в репозиторий в github, прикрепить текстовый файл с сылкой на проект',
    lab4: 'Реализовать изменение темы (день/ночь) используя Context. useState и useEffect - простые примеры',
    lab9: 'Написать тест для компонента кнопки Провести рефакторинг страницы со списком данных с сервера. Переписать запрос к backend через rtk-query(useGetPostsQuery). Используя isError, isLoading, isFetching отрисовать спиннер загрузки, сообщение об ошибке и результат успешного запроса'
}

